Tekla.Structures.Drawing.Image
The Image class defines an image that can be inserted into a drawing.

Tekla.Structures.Drawing.Image.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.String)
Initializes a new instance of the Tekla.Structures.Drawing.Image class with the given parameters.
view: The view to be used.
insertionPoint: The insertion point to be used.
fileName: The filename to be used.
Throws System.IO.FileNotFoundException: Thrown if the specified file does not exist.

Tekla.Structures.Drawing.Image.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,System.String,Tekla.Structures.Drawing.EmbeddedObjectAttributes)
Initializes a new instance of the Tekla.Structures.Drawing.Image class using the specified attributes.
view: The view to be used.
insertionPoint: The insertion point to be used.
fileName: The filename to be used.
attributes: The attributes to be used.
Throws System.IO.FileNotFoundException: Thrown if the specified file does not exist.

Tekla.Structures.Drawing.Image.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.Size,System.String)
Initializes a new instance of the Tekla.Structures.Drawing.Image class with the given parameters.
view: The view to be used.
insertionPoint: The insertion point to be used.
frameSize: The frames size.
fileName: The filename to be used.
Throws System.IO.FileNotFoundException: Thrown if the specified file does not exist.

Tekla.Structures.Drawing.Image.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.Size,System.String,Tekla.Structures.Drawing.EmbeddedObjectAttributes)
Initializes a new instance of the Tekla.Structures.Drawing.Image class using the specified attributes.
view: The view to be used.
insertionPoint: The insertion point to be used.
frameSize: The frames size.
fileName: The filename to be used.
attributes: The attributes to be used.
Throws System.IO.FileNotFoundException: Thrown if the specified file does not exist.

Tekla.Structures.Drawing.Image.#ctor
Initializes a new instance of the Tekla.Structures.Drawing.Image class.

Tekla.Structures.Drawing.Image.Initialize
Sets inherited member properties.